[
  {
    "section": "RULE 1 - COURT DIMENSIONS",
    "content": "The playing court shall be measured and marked as shown in the court diagram. The court shall be 94 feet long and 50 feet wide from the inner edges of the boundary lines. The court shall be divided into two equal parts by the center line, which shall be drawn parallel to the end lines."
  },
  {
    "section": "RULE 2 - EQUIPMENT",
    "content": "All equipment used must be appropriate for basketball of the highest professional level. Equipment must be authorized and authenticated by the league and must meet league safety standards and performance specifications."
  },
  {
    "section": "RULE 3 - PLAYERS, SUBSTITUTES AND COACHES",
    "content": "Each team shall consist of five players. No team shall be reduced to less than five players. If a player in the game receives his sixth personal foul and all substitutes have been disqualified, said player shall remain in the game and shall be charged with a personal and team foul. A technical foul also shall be assessed against his team. All subsequent personal fouls, including offensive fouls, shall be treated similarly. All players who have been disqualified may remain on the bench."
  },
  {
    "section": "RULE 4 - DEFINITIONS",
    "content": "Section I—Basket/Backboard. a. A team's basket consists of the basket ring and net through which its players try to shoot the ball. The visiting team has the choice of baskets for the first half. The basket selected by the visiting team when it first enters onto the court shall be its basket for the first half."
  },
  {
    "section": "RULE 5 - SCORING AND TIMING",
    "content": "Section I—Scoring. a. A legal field goal or free throw attempt shall be scored when a ball from the playing area enters the basket from above and remains in or passes through the net. b. A successful field goal attempt from the area on or inside the three-point field goal line shall count two points. c. A successful field goal attempt from the area outside the three-point field goal line shall count three points."
  },
  {
    "section": "RULE 6 - PUTTING BALL IN PLAY",
    "content": "The ball shall be put into play in the following ways: a. After a made basket: (1) The team not credited with the score shall inbound the ball at any point out-of-bounds at the baseline where the basket was scored. (2) The team not credited with the score shall inbound the ball within five seconds. b. After a free throw: (1) After a free throw that is not followed by another free throw, the ball shall be put into play by a throw-in: (a) If the free throw is successful, by any player of the team not credited with the score."
  },
  {
    "section": "RULE 7 - SHOT CLOCK",
    "content": "Section I—Shot Clock. a. The shot clock shall start when a team gains new possession of a ball which is in play. b. On a throw-in, the shot clock shall start when the ball is legally touched by any player on the playing court. c. The shot clock shall be reset when: (1) A team gains possession of a live ball on the playing court. (2) The ball contacts the basket ring of the team which is in possession of the ball."
  },
  {
    "section": "RULE 8 - OUT-OF-BOUNDS AND THROW-IN",
    "content": "Section II—Ball in Backcourt. A player shall not be the first to touch a ball which he or a teammate caused to go from frontcourt to backcourt while his team was in control of the ball. EXCEPTION: Rule 8—Section III—e. During a jump ball, a try for a goal, or a situation in which a player taps the ball away from a congested area as defined in Rule 8—Section II—d. PENALTY: Loss of ball. The ball is awarded to the opposing team at the midcourt line."
  },
  {
    "section": "RULE 9 - FREE THROWS AND PENALTIES",
    "content": "Section I—Free Throw. a. The free throw(s) awarded because of a personal foul shall be attempted by the offended player. b. If the offended player is injured, other than as a result of a flagrant foul or unsportsmanlike conduct, or is ejected from the game and cannot attempt the awarded free throw(s), the opposing coach shall select, from his opponent's bench, the player who will replace the injured player. That player will attempt the free throw(s) and the injured player will not be permitted to re-enter the game."
  },
  {
    "section": "RULE 10 - VIOLATIONS AND PENALTIES",
    "content": "Section VIII—Three-Second Rule. An offensive player shall not remain for more than three seconds in that part of his free throw lane between the end line and extended 4' (imaginary) off the court and the farther edge of the free throw line while the ball is in control of his team. Allowance may be made for a player who, having been in this area for less than three seconds, is in the act of shooting at the end of the third second. Under these conditions, the 3-second count is discontinued while his continuous motion is toward the basket. If that continuous motion ceases, the previous 3-second count is continued. This is not to be confused with the count toward the 5-second rule."
  },
  {
    "section": "RULE 11 - BASKET INTERFERENCE—GOALTENDING",
    "content": "Section I—A player shall not touch the ball or the basket ring when the ball is sitting or rolling on the ring and using the basket ring as its lower base or hang on the rim while the ball is passing through. EXCEPTION: If a player near his own basket has his hand legally in contact with the ball, it is not a violation if his contact with the ball continues after the ball enters the cylinder, or if, in such action, he touches the basket. The cylinder is the imaginary vertical extension of the ring. All players must be allowed to play the ball in the vertical space immediately above the ring. PENALTY: The goal is scored when it involves the offensive team. A game ball shall be awarded to the offensive team at the free throw line extended when it involves the defensive team. NOTE: If the imaginary rectangle above the basket is violated, the points are awarded."
  },
  {
    "section": "RULE 12 - FOULS AND PENALTIES",
    "content": "Section I—Types. a. A personal foul is illegal physical contact which occurs with an opponent after the ball has become live. EXCEPTION: Contact which occurs on an opponent's hand and/or wrist is not considered a foul if that contact takes place after the opponent has released the ball during a shooting motion. b. A common foul is a personal foul which is neither flagrant nor committed against a player in the act of shooting. c. A flagrant foul is unnecessary and/or excessive contact committed by a player against an opponent. d. A punching foul is a punch by a player which makes contact with an opponent whether the ball is dead or alive. e. An away-from-the-play foul is illegal contact by the defense in the last two minutes of the game, and last two minutes of overtime periods, which occurs (i) deliberately away from the immediate area where the ball is located at the time of the foul, or (ii) prior to the ball being released on a throw-in."
  },
  {
    "section": "RULE 12 - FOULS AND PENALTIES",
    "content": "Section I—(3) Clear Path to the Basket: If a personal foul is committed against an offensive player with the ball while that offensive player has a clear path to the basket, a clear path to the basket foul is called and the offensive team is awarded two free throws and the ball out of bounds on the sideline nearest the spot where play was interrupted but no further back than the free throw line extended. The clear path to the basket foul is defined as a personal foul against any offensive player during his team's transition scoring opportunity in the following circumstances: (1) the ball is ahead of the tip of the circle in the backcourt; (2) the offensive player is in control of the ball (or a pass has been thrown to him) with a clear path to the basket; and (3) there is no defender ahead of the offensive player in the frontcourt who is in a position to defend against the offensive player."
  },
  {
    "section": "RULE 13 - INSTANT REPLAY",
    "content": "Section I—Instant Replay. a. Instant replay may be used in the following situations: (1) To determine whether a field goal was scored correctly as a two-point or three-point field goal or, in the case of a called foul, whether the player was attempting a two or three-point field goal. (2) To determine whether a called game clock or shot clock violation occurred, and which team possessed the ball at the time the game clock or shot clock expired."
  },
  {
    "section": "RULE 14 - COACHES CHALLENGE",
    "content": "Section I—Coaches Challenge. a. Each head coach is entitled to one coach's challenge throughout the course of the game. b. A team may utilize a coach's challenge by calling a legal timeout and immediately notifying the officials of the challenge. c. If the challenge is successful, the team retains its timeout and is permitted to challenge again during the game. If a team's challenge is unsuccessful, the team loses its timeout and may not challenge again."
  }
]